fun main(args: Array<String>) {

    val text: String = "hello world"
    val subSequence: CharSequence = text.subSequence(0, 4)
    print(subSequence)
}
/*
 Реализовать на языке Kotlin класс репрезентирующий строку. Класс должен поддерживать базовые для строки возможности, как то:
    1.создание строки
    2.конкатенация и обрезание строк
    3.поиск в строке
    4.преобразование числа типа Integer в строку
    5.преобразование строки в число типа Float
    6.результирующий класс должен быть покрыт тестами - так и вам писать легче и нам проверять.








































*/